app/controllers/vishal2s_controller.rb

  def create
    @vishal2 = Vishal2.new(vishal2_params)
    if @vishal2.save
---
INSERT INTO "vishal2s" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "vishal"], ["created_at", "2024-07-31 07:48:25.999554"], ["updated_at", "2024-07-31 07:48:25.999554"]]