app/controllers/vishal123s_controller.rb

  def create
    @vishal123 = Vishal123.new(vishal123_params)
    if @vishal123.save
---
INSERT INTO "vishal123s" ("name", "email", "terms_of_service", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "vishal"], ["email", "vishal@gmail.com"], ["terms_of_service", 1], ["created_at", "2024-07-30 09:26:18.474024"], ["updated_at", "2024-07-30 09:26:18.474024"]]