app/controllers/vishal1s_controller.rb

  def create
    @vishal1 = Vishal1.new(vishal1_params)
    if @vishal1.save
---
INSERT INTO "vishal1s" ("name", "email", "terms_of_service", "created_at", "updated_at", "code") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "vishal"], ["email", "vishal@gmail.com"], ["terms_of_service", 1], ["created_at", "2024-07-30 11:45:25.923169"], ["updated_at", "2024-07-30 11:45:25.923169"], ["code", "abc"]]